Ran Plan for project: `seamless-creative-test-dev` dir: `seamless-creative-new` workspace: `dev`

<details><summary>Show Output</summary>

```diff
Switched to workspace "dev".

google_storage_bucket.seamless-bucket["atlantis-dev-test1122333"]: Refreshing state... [id=atlantis-dev-test1122333]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # google_storage_bucket.seamless-bucket["atlantis-dev-test11223233"] will be created
+ resource "google_storage_bucket" "seamless-bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EUROPE-CENTRAL2"
      + name                        = "atlantis-dev-test11223233"
      + project                     = "snappy-byway-396909"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # google_storage_bucket.seamless-bucket["atlantis-dev-test1122333"] will be destroyed
  # (because key ["atlantis-dev-test1122333"] is not in for_each map)
- resource "google_storage_bucket" "seamless-bucket" {
      - default_event_based_hold    = false -> null
      - force_destroy               = false -> null
      - id                          = "atlantis-dev-test1122333" -> null
      - labels                      = {} -> null
      - location                    = "EUROPE-CENTRAL2" -> null
      - name                        = "atlantis-dev-test1122333" -> null
      - project                     = "snappy-byway-396909" -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/atlantis-dev-test1122333" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://atlantis-dev-test1122333" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.


ok
total 36
drwxr-xr-x 3 root root 4096 Aug 25 11:08 .
drwx------ 4 root root 4096 Aug 25 11:08 ..
drwxr-xr-x 3 root root 4096 Aug 25 11:08 .terraform
-rw-r--r-- 1 root root  255 Aug 25 11:08 .terraform.lock.hcl
-rw-r--r-- 1 root root  212 Aug 25 11:08 README.md
-rw-r--r-- 1 root root  741 Aug 25 11:08 main.tf
-rw-r--r-- 1 root root 4000 Aug 25 11:08 seamless-creative-test-dev-dev.tfplan
-rw-r--r-- 1 root root  648 Aug 25 11:08 terraform.tfvars
-rw-r--r-- 1 root root  270 Aug 25 11:08 variables.tf
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seamless-creative-test-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-test.itoutposts.ltd/lock?id=andrew-ito%252Fatlantis-poc%252Fseamless-creative-new%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seamless-creative-test-dev`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`